Repository: Automattic/syntaxhighlighter
Catalog: localization/_syntaxhighlighter-*.po
Languages: da_dk, es_es, it_it, ja

source: Default
da_dk: Standard
es_es: Defecto
it_it: Predefinito

source: Fade to Grey
da_dk: Fade til gråt
es_es: Descolorar a gris

source: [None]
da_dk: [Ingen]
es_es: [Ninguno]
it_it: [nessuno]
ja: [なし]

source: SyntaxHighlighter Settings
da_dk: SyntaxHighlighter-indstillinger
es_es: Ajustes de SyntaxHighlighter
it_it: Impostazioni SyntaxHighlighter
ja: SyntaxHighlighterの設定

source: Settings
da_dk: Indstillinger
es_es: Ajustes
it_it: Impostazioni
ja: 設定

source: show source
da_dk: vis kilde
es_es: mostrar fuente
it_it: mostra sorgente
ja: ソースを見る

source: view source
da_dk: Vis kilde
es_es: ver fuente
it_it: vedi sorgente
ja: ソースを表示

source: copy to clipboard
da_dk: Kopiér til clipboard
es_es: copiar al portapapeles
it_it: copia negli appunti
ja: クリップボードへコピー

source: The code is in your clipboard now
da_dk: Koden er i dit clipboard nu
es_es: El código esta ahora en tu portapapeles
it_it: Il codice é da ora nei tuoi appunti
ja: コードをクリップボードへコピーしました

source: print
da_dk: udskriv
es_es: imprimir
it_it: stampa
ja: 印刷

source: Can't find brush for:
da_dk: Kan ikke finde penslen (syntaks-definitioner) til:
es_es: No se ha podido encontrar una definición de sintaxis para
it_it: Non é stato possibile trovare il file di sintassi per:
ja: 指定のブラシが見つかりませんでした:

source: Brush wasn't configured for html-script option:
da_dk: Pensel (syntaks-definitioner) er ikke konfigureret for html-script-indstillignen:
es_es: La definición de sintaxis para la opción html-script no se configuró
it_it: Il file di sintassi non é stato configurato per l'opzione html-script
ja: HTMLスクリプトのオプションのためにブラシが構成されませんでした:

source: + expand source
es_es: + ampliar fuente
it_it: + espandi sorgente
ja: ソースを表示

source: Are you sure you want to reset your settings to the defaults?
da_dk: Er du sikker på, at du ønsker at nulstille dine indstillinger standardværdierne?
es_es: ¿Estas seguro de que quieres restablecer las opciones a las de por defecto?
it_it: Sei certo di volere ripristinare le impostazioni alle predefinite?
ja: 設定を初期化してもよいですか?

source: Settings reset to defaults.
da_dk: Indstillinger nulstillet til standardværdierne.
es_es: Opciones restablecidas a las de por defecto.
it_it: Ripristina le impostazioni alle predefinite
ja: 設定を初期化する

source: Highlighter Version
es_es: Versión Highlighter
it_it: Versione Highlighter
ja: SyntaxHighlighterのバージョン

source: Version 3.x
es_es: Versión 3.x
it_it: Versione 3.x

source: Version 2.x
es_es: Versión 2.x
it_it: Versione 2.x

source: Version 3 allows visitors to easily highlight portions of your code with their mouse (either by dragging or double-clicking) and copy it to their clipboard. No toolbar containing a Flash-based button is required.
es_es: La versión 3 permite a los visitantes arrastrar fácilmente porciones de sus códigos con el ratón ( igualmente manteniendo o haciendo doble click) y copiarlos a sus portapapeles. No requiere de una barra de herramientas con un botón de Flash-based.
it_it: La versione 3 permette agli utenti di evidenziare facilmente con il mouse delle porzioni del tuo codice (altresì spostare/doppio-click) potendolo copiare nei loro appunti. Non sarà necessaria nessuna toolbar contenente un pulsante a base-Flash.
ja: バージョン3は、訪問者が簡単にマウスを使用して（ドラッグかダブルクリック）、コードの部分を強調表示し、クリップボードにへコピーできます。Flashベースボタンを含むツールバーが不要です。

source: Version 2 allows for line wrapping, something that version 3 does not do at this time.
es_es: La versión 2 permite el wrap por línea, algo que la versión 3 no hace en este momento.
it_it: La versione 2 permette il wrap per la linea, funzione questa non ancora disponibile per la versione 3.
ja: バージョン2は行 の折り返しが許可されています、この機能は現時点でバージョン3はサポートされません

source: Color Theme
da_dk: Farvetema
es_es: Color del tema
it_it: Colore del tema
ja: テーマ

source: Load All Brushes
es_es: Cargar todas las opciones de sintaxis
it_it: Carica tutti i brush
ja: すべてのブラシを読み込む

source: Always load all language files (for directly using <code>&lt;pre&gt;</code> tags rather than shortcodes)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If left unchecked (default), then language files will only be loaded when needed<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If unsure, leave this box unchecked
es_es: Carga siempre todos los archivos de lenguaje (usando directamente <code>&lt;pre&gt;</code> etiquetas mejor que shortcodes)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Si está sin marcar (por defecto), luego los archivos de lenguaje solamente se cargarán cuando lo necesiten<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Si no estas seguro deja la caja sin marcar
it_it: Carica sempre tutti i file di linguaggio (per utilizzo diretto dei tag <code>&lt;pre&gt;</code> piuttosto che gli shortcode)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se non attivo (predefinito), i file di linguaggio saranno caricati secondo necessità<br />&nbsp;&nbsp;
ja: 常にすべての言語ファイルを読込みます（ショートコードではなく、<code>&lt;pre&gt;</code>タグを直接使用する場合）<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;オフ（デフォルト）の場合、言語ファイルは必要に応じてロードされます。<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;よくわからない場合は、このチェックボックスをオフのままにしてください。

source: Defaults
da_dk: Standardværdier
es_es: Parámetros por defecto
it_it: Parametri predefiniti
ja: 規定の設定

source: All of the settings below can be configured on a per-code block basis, but you can control the defaults of all code blocks here.
es_es: Todas las opciones de abajo pueden ser configuradas como un bloque singular común, pero puedes controlar los valores por defecto de todos los bloques de código aquí.
it_it: Tutte le impostazioni qui sotto potranno essere configurate singolarmente comunque, sarà altresì possibile controllare qui le predefinite per tutti i blocchi codice.
ja: 設定はコードの出力ごとに構成できますが、規定の設定をここで指定できます

source: Miscellaneous
da_dk: Forskelligt
es_es: Variado
it_it: Varie
ja: 一般

source: Display line numbers
da_dk: Vis linjenumre
es_es: Mostrar los números de la línea
it_it: mostra la numerazione delle linee
ja: 行番号を表示する

source: Display the toolbar
da_dk: Vis værktøjslinje
es_es: Mostrar la barra de herramientas
it_it: mostra la barra degli strumenti
ja: ツールバーを表示する

source: Automatically make URLs clickable
da_dk: Lav automatisk URL'er klikbare
es_es: Automáticamente hace que las URLs sean marcables
it_it: rendi gli URL cliccabili (in automatico)
ja: 自動リンクを有効にする

source: Collapse code boxes
da_dk: Vis kodebokse med koden skjult
es_es: Colapsar las cajas de código
it_it: comprimi le caselle del codice
ja: コードボックスの表示を閉じておく

source: Use the light display mode, best for single lines of code
da_dk: Brug "bar visning" &ndash; bedst for enkelte linjer af kode
es_es: Utiliza mejor el modo de muestra claro para lineas de código simples
it_it: utilizza la modalità light del tema, ideale per le singole linee di codice
ja: 軽い表示モードを使う

source: Use smart tabs allowing tabs being used for alignment
da_dk: Brug smarte tabs, så tabs kan bruges til opstilling
es_es: Utiliza las smart tabs de modo que permitan las tabs ser utilizadas para el alineamiento
it_it: utilizza le smart tabs in modo che le tag siano utilizzate per l'allineamento
ja: インデントタブを許容するスマートタブを使う

source: Wrap long lines (v2.x only, disabling this will make a scrollbar show instead)
es_es: Wrap líneas largas (únicamente en v2.x , deshabilitando esta se mostrará un scrollbar en su lugar)
it_it: Wrap per le righe di grandi dimensioni (solo v2.x, disattivando l'opzione si otterrà una barra di scorrimento)
ja: 長い行を折り返す(v2.xのみ、横スクロールバーを無効にする)

source: Enable &quot;HTML script&quot; mode by default (see the bottom of this page for details). Checking this box is not recommended as this mode only works with certain languages.
da_dk: Aktivér &quot;HTML-script&quot;-funktion som standard (se detaljerne nederst på denne side). Det anbefales ikke at krydse af her, da denne funktion kun fungerer med visse sprog.
es_es: Permitir &quot;HTML script&quot; modo por defecto (mirar el final de la página para más detalles). Marcar esta opción no es recomendable ya que este modo solo funciona con ciertos lenguajes.
it_it: Abilita la modalità &quot;HTML script&quot; come predefinita (vedi i dettagli a fondo pagina). La selezione di questa casella non é raccomandabile poiché la funzione lavora solamente con alcuni linguaggi.
ja: &quot;HTMLスクリプト&quot; モードを有効にする。 (詳細はこのページの下を参照)。Checking this box is not recommended as this mode only works with certain languages.

source: Additional CSS Class(es)
da_dk: Ekstra CSS-class(es)
es_es: Clase(es) de Css adicional(es)
it_it: classe/i CSS addizionali
ja: 追加のCSSのclass名(複数可能)

source: Starting Line Number
da_dk: Første linjenummer:
es_es: Número de inicio de la línea
it_it: Numero di inizio linea
ja: 行番号の開始

source: Line Number Padding
da_dk: Padding omkring linjenumre
es_es: Padding de la numeración de la línea
it_it: Padding numerazione linea
ja: 行番号の余白

source: Automatic
da_dk: Automatisk
es_es: Automático
it_it: Automatico
ja: 自動

source: Tab Size
da_dk: Tabstørrelse:
es_es: Tamaño del Tab
it_it: Dimensione tab
ja: タブのサイズ

source: Title
es_es: Título
it_it: Titolo
ja: タイトル

source: Some optional default text to display above each code block or as the clickable text for collapsed code blocks.
es_es: Texto por defecto opcional para mostrar debajo de cada bloque de código o como texto clickable para bloques de código colapsados.
it_it: Testo predefinito e facoltativo da mostrare al di sopra di ogni blocco codice o come testo cliccabile per i blocchi codice da espandere.
ja: いくつかのオプションの既定のテキストは、各コードブロックの上または折りたたまれたコードブロックのクリック可能なテキストとして表示する

source: Reset to Defaults
da_dk: Gendan til standardværdier
es_es: Restablecer a parámetros por defecto
it_it: Ripristina alle predefinite
ja: 設定を初期化

source: Save Changes
da_dk: Gem ændringer
es_es: Guardar cambios
it_it: Salva le modifiche
ja: 変更を保存

source: Preview
da_dk: Forhåndsvisning
es_es: Vista previa
it_it: Anteprima della casella
ja: プレビュー

source: Click &quot;Save Changes&quot; to update this preview.
da_dk: Klik &quot;Gem ændringer&quot; for at opdatere denne forhåndsvisning.
es_es: Clicar &quot;Save Changes&quot; para cargar esta vista previa.
it_it: Clicca &quot;Salva le modifiche&quot; per visualizzare l'anteprima aggiornata.
ja: プレビューを更新するには &quot;変更を保存&quot; をクリックしてください

source: PHP Code Example
da_dk: Eksempel på PHP-kode
es_es: Ejemplo de código PHP
it_it: Codice PHP di esempio
ja: PHP コードサンプル

source: Hello World!
da_dk: Hej verden!
es_es: ¡Hola mundo!

source: This line is highlighted.
da_dk: Denne linje er fremhævet.
es_es: Esta línea esta destacada.
it_it: Questa linea é evidenziata.
ja: この行はハイライトされました

source: This is an example of smart tabs.
es_es: Este es un ejemplo de smart tabs.
ja: この 行は スマート タブ の 例 です。

source: Shortcode Parameters
da_dk: Kortkode-parametre.
es_es: Parámetros de Shortcode
it_it: Parametri per lo shortcode
ja: ショートコードパラメータ

source: These are the parameters you can pass to the shortcode and what they do. For the booleans (i.e. on/off), pass %1$s/%2$s or %3$s/%4$s.
da_dk: Her er parametrene, du kan medtage i kortkoderne, samt hvad de gør. For de booleske (dvs. til/fra), brug %1$s/%2$s eller %3$s/%4$s
es_es: Estos son los parámetros que puedes pasar a los shortcode y los que puedes utilizar. Para los boleanos(i.e. on/off), pasar %1$s/%2$s or %3$s/%4$s.
it_it: Lista dei parametri (e loro funzioni) che potrai inserire nello shortcode. Per i booleani (es: on/off), inserisci %1$s/%2$s oppure %3$s/%4$s.
ja: これらはショートコードで渡すことができるパラメータと説明です。 bool値(有効・無効など)の指定には %1$s/%2$s または %3$s/%4$s を渡してください。

# language parameter
source: %1$s or %2$s &#8212; The language syntax to highlight with. You can alternately just use that as the tag, such as <code>[php]code[/php]</code>. <a href="%3$s">Click here</a> for a list of valid tags (under &quot;aliases&quot;).
es_es: %1$s or %2$s &#8212; Este es el lenguaje para destacar. Solo puedes utilizar esta alternativamente como etiquéta, como ejemplo <code>[php]code[/php]</code>. <a href="%3$s">Clica aquí</a> para una lista de etiquetas validas (under &quot;aliases&quot;).
ja: %1$s または %2$s &#8212; ハイライトするコードの言語。パラメータ指定だけでなく<code>[php]code[/php]</code>のように言語をタグとして記述できます。有効なタグのリストは <a href="%3$s">こちらをクリック</a> (&quot;aliases&quot;の下を参照)

# autolinks parameter
source: %s &#8212; Toggle automatic URL linking.
es_es: %s &#8212; Conmutación automática del enlace de URL.
ja: %s &#8212; 自動リンクの有効・無効

# classname parameter
source: %s &#8212; Add an additional CSS class to the code box.
es_es: %s &#8212; Añade una clase de CSS adicional para la caja de código.
ja: %s &#8212; コードボックスに追加するCSSのclass

# collapse parameter
source: %s &#8212; Toggle collapsing the code box by default, requiring a click to expand it. Good for large code posts.
es_es: %s &#8212; Conmutación del colapso de la caja de código por defecto, requiriendo de un clic para ampliarse. Bueno para posts con mucho código.
ja: %s &#8212; コードボックスをデフォルトの状態で閉じるかどうか。コードボックスを開くにはクリックが要求されます。長いコードの出力の際に有効です。

# firstline parameter
source: %s &#8212; An interger specifying what number the first line should be (for the line numbering).
es_es: %s &#8212; Un número entero para definir con que número debería iniciar la primera línea (para la numeración de la línea).
ja: %s &#8212; 行番号の出力の際に、最初の行の番号を表す数値

# gutter parameter
source: %s &#8212; Toggle the left-side line numbering.
es_es: %s &#8212; Conmutar el numerado de la línea del lado izquierdo.
ja: %s &#8212; 左側に行番号を配置するかどうか

# highlight parameter
source: %1$s &#8212; A comma-sperated list of line numbers to highlight. You can also specify a range. Example: %2$s
es_es: %1$s &#8212; Una lista (comma-sperated) de números en línea para destacar. Puedes además especificar un rango. Ejemplo: %2$s
ja: %1$s &#8212; ハイライトさせる行番号のリスト（カンマ区切り）、範囲でも指定可能。例: %2$s

# htmlscript parameter
source: %s &#8212; Toggle highlighting any extra HTML/XML. Good for when you're mixing HTML/XML with another language, such as having PHP inside an HTML web page. The above preview has it enabled for example. This only works with certain languages.
es_es: %s &#8212; Conmutar destacado para cualquier HTML/XML. Bueno para cuando estas mezclando HTML/XML con cualquier otro lenguaje, como tener PHP dentro de una página web HTML. La vista previa de abajo la tiene activada como ejemplo. Esto solo funciona con ciertos lenguajes.
ja: %s &#8212; HTML/XML をハイライトするかどうか。HTMLウェブページで PHP を使うようにHTML/XMLとプログラムが混在するような時に有効です。上のプレビューではこの設定が有効になっています。これは特定の言語でしか動作しません。

# light parameter
source: %s &#8212; Toggle light mode which disables the gutter and toolbar all at once.
es_es: %s &#8212; Conmutar el modo claro el cual deshabilita a la vez el gutter y la barra de herramientas.
ja: %s &#8212; 行番号やツールバーを無効にする軽い表示モードのオン・オフ

# padlinenumbers parameter
source: %s &#8212; Controls line number padding. Valid values are <code>false</code> (no padding), <code>true</code> (automatic padding), or an integer (forced padding).
es_es: %s &#8212; Controla el padding de los números en línea. Los valores válidos son <code>false</code> (sin padding), <code>true</code> (padding automatico), o un entero (fuerza el padding).
ja: %s &#8212; 行番号の余白。有効な値は、 <code>false</code>(余白なし), <code>true</code> (自動)、数値(余白)

# title parameter
source: %1$s (v3 only) &#8212; Sets some text to show up before the code. Very useful when combined with the %2$s parameter.
es_es: %1$s (solo en v3) &#8212; Selecciona algún texto para mostrar antes del código. Muy útil cuando se combina con el parámetro %2$s.
ja: %1$s （v3のみ） &#8212; コードの前に表示される表題テキスト。%2$sのパラメータと合わせて使うと有効です。

# toolbar parameter
source: %s &#8212; Toggle the toolbar (buttons in v2, the about question mark in v3)
es_es: %s &#8212; Conmuta la barra de herramientas (los botones en v2, la opción de la pregunta about en v3)
ja: %s &#8212; ツールバーのオン・オフ(v2のボタン、v3のクエッションマーク)

# wraplines parameter
source: %s (v2 only) &#8212; Toggle line wrapping.
es_es: %s (solo en v2) &#8212; Conmuta el wrapping de línea.
ja: %s (v2のみ) &#8212; 折り返しの有効・無効

source: Some example shortcodes:
da_dk: Nogle eksempler på kortkoder:
es_es: Algunos ejemplos de shortcodes:
it_it: Alcuni esempi di shortcode:
ja: 引数指定の例:

source: your code here
da_dk: din kode her
es_es: introduce tu código aquí
it_it: inserisci qui il tuo codice
ja: ここにコードを入れます

source: example-filename.php
es_es: ejemplo-nombredearchivo.php

source: Easily post syntax-highlighted code to your site without having to modify the code at all. Uses Alex Gorbatchev's <a href="http://alexgorbatchev.com/wiki/SyntaxHighlighter">SyntaxHighlighter</a>. <strong>TIP:</strong> Don't use the Visual editor if you don't want your code mangled. TinyMCE will "clean up" your HTML.
es_es: Introduce sintaxis destacadas de código a tu sitio sin tener que modificar el código del todo . Utiliza el Alex Gorbatchev's <a href="http://alexgorbatchev.com/wiki/SyntaxHighlighter">SyntaxHighlighter</a>. <strong>TIP:</strong> No utilizes el editos Visual si no quieres estropear tu código. TinyMCE limpiará tu HTML.

source: Off
da_dk: Fra
it_it: Spento
ja: なし

source: Viper007Bond
ja: Viper007Bond氏

source: All of the settings below can be configured on a per-code box basis, but you can control the defaults of all code boxes here.
da_dk: Alle indstillinger nedenfor kan konfigureres for hver kode-boks for sig, men du kan kontrollere standardværdierne for alle kode-bokse her.

source: Wrap long lines, using an icon to show where line wraps occur (disabling this will make a scrollbar show instead)
da_dk: Del lange linjer med et ikon, der viser, hvor linjedeling forekommer (deaktiverer du dette, vises en scrollbar i stedet)

source: This is an example of smart tabs.
da_dk: Dette er et eksempel på smarte tabs.
it_it: Questo é un esempio di smart tabs.

source: %1$s or %2$s &#8212; The language syntax to highlight with. You can alternately just use that as the tag, such as <code>[php]code[/php]</code>. <a href="%3$s">Click here</a> for a list of valid tags (under &quot;aliases&quot;).
da_dk: %1$s eller %2$s &#8212; Sprogsyntaksen til at fremhæve med. Alternativt kan du bruge dem som tags, så som <code>[php]code[/php]</code>. <a href="%3$s">Klik her</a>, hvis du vil se en liste med gyldige tags (under &quot;aliasser&quot;).

source: %s &#8212; Toggle automatic URL linking.
da_dk: %s &#8212; Slår automatisk URL-linkning til/fra.

source: %s &#8212; Add an additional CSS class to the code box.
da_dk: %s &#8212; Tilføjer en ekstra CSS-class til kode-boksen.

source: %s &#8212; Toggle collapsing the code box by default, requiring a click to expand it. Good for large code posts.
da_dk: %s &#8212; Som standard skjules koden i kodeboksen, så der skal klikkes for at vise koden. Nyttigt til indlæg med megen kode.

source: %s &#8212; An interger specifying what number the first line should be (for the line numbering).
da_dk: %s &#8212; Et heltal, som angiver, hvilken nummer den første linje skal have (til brug for linjenummerering).

source: %s &#8212; Toggle the left-side line numbering.
da_dk: %s &#8212; Skifter mellem linjenummerering til venstre og til højre.

source: %s &#8212; A comma-sperated list of line numbers to highlight.
da_dk: %s &#8212; En kommasepareret liste med linjenumre, der skal fremhæves.

source: %s &#8212; Toggle highlighting any extra HTML/XML. Good for when you're mixing HTML/XML with another language, such as having PHP inside an HTML web page. The above preview has it enabled for example. This only works with certain languages.
da_dk: %s &#8212; Slår fremhævelse af ekstra HTML/XML til/fra. Det er nyttigt, når du bruger HTML/XML sammen med et andet sprog, som f.eks. hvis du har PHP på en HTML-webside. Eksempelvis har ovenstående forhåndsvisning det aktiveret. Funktionen virker kun med visse sprog.

source: %s &#8212; Toggle light mode which disables the gutter and toolbar all at once.
da_dk: %s &#8212; Slår "bar fremvisning" til/fra, hvilket skjuler "afløbsrenden" og værktøjslinjen med det samme.

source: %s &#8212; Controls line number padding. Valid values are <code>false</code> (no padding), <code>true</code> (automatic padding), or an integer (forced padding).
da_dk: %s &#8212; Kontrollerer padding omkring linjenumre. Gyldige værdier er <code>false</code> (inge padding), <code>true</code> (automatisk padding) eller en integer (tvungen padding).

source: %s &#8212; Toggle the toolbar containing the helpful buttons.
da_dk: %s &#8212; Slår værktøjslinjen med nyttige knapper til/fra.

source: %s &#8212; Toggle line wrapping.
da_dk: %s &#8212; Slår linjedeling til/fra.
